---
kind: property
id: P:Autodesk.Revit.DB.DisplacementElement.ParentId
source: html/2faf0cca-a05a-45dc-d7e4-e61443a53623.htm
---
# Autodesk.Revit.DB.DisplacementElement.ParentId Property

The element id of the parent DisplacementElement. This DisplacementElement's relative transform
 will be concatenated with the absolute transform of its parent.

## Syntax (C#)
```csharp
public ElementId ParentId { get; }
```